Catalogs/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Вакансии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаПодборПерсонала</xr:Item>
				<xr:Item>Catalog.ПрофилиДолжностей</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗакрытия</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПодборПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыРаботыСКандидатами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапРаботы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнструментОценкиХарактеристикПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОценкиХарактеристик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОценкиХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СостоянияВакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияВакансии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Вакансии/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГлобальныеКомандыФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастроитьВидСпискаВакансий();
	УстановитьОтборСпискаПодразделений();
	
	НастроитьСписокВакансий();
	РекрутинговыеСайтыФормы.ФормаСпискаВакансийПриСозданииНаСервере(ЭтотОбъект);
	НастроитьСписокКандидатов();
	
	ЗагрузкаКандидатовИзИнтернетаФормы.ФормаСОповещениямиПриСозданииНаСервере(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("ОбновитьИнформационныеСтрокиВакансии", ПериодичностьОбновления(), Ложь);
	
	ЗагрузкаКандидатовИзИнтернетаКлиент.ФормаСОповещениямиПриОткрытии(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыНастройкиДоступаКСайтам" Тогда
		ОбработкаОповещенияИзмененыНастройкиДоступаКСайтам();
	ИначеЕсли ИмяСобытия = "ЗагруженыВакансии" Тогда
		Элементы.Вакансии.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "СогласованиеВакансий_Завершено" Тогда
		Элементы.Вакансии.Обновить();
	КонецЕсли;
	
	ОбработатьОповещенияЭтаповРаботыСКандидатами(ИмяСобытия, Параметр, Источник);
	ОбработатьОповещенияИзмененияВакансии(ИмяСобытия, Параметр, Источник);
	ОбработатьОповещенияИзмененияПозиции(ИмяСобытия, Параметр, Источник);
	ОбработатьОповещенияИзмененияЧисленности(ИмяСобытия, Параметр, Источник);
	ОбработатьОповещенияИзмененияКандидата(ИмяСобытия, Параметр, Источник);
	
	ЗагрузкаКандидатовИзИнтернетаКлиент.ФормаСОповещениямиОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОбработкаНавигационнойСсылкиПозицияМассовогоНабора(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработкаНавигационнойСсылкиСотрудникиПозиции(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ПодборПерсоналаФормыКлиент.ОбработкаНавигационнойСсылкиЭтапаКандидатов(
		ЭтотОбъект, ВыбраннаяВакансия, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокПодобранных.Количество() > 0 Тогда
		ОповеститьОВыборе(СписокПодобранных.ВыгрузитьЗначения());
	КонецЕсли;
	
	ЗагрузкаКандидатовИзИнтернетаКлиент.ФормаСОповещениямиПриЗакрытии(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктураПредприятия

&НаКлиенте
Процедура СтруктураПредприятияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоПодразделениюНаКлиенте", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВакансии

&НаКлиенте
Процедура ВакансииПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиВакансииНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВакансииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Не Элементы.Вакансии.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрыватьПриВыборе Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	МассивВыбранных = Элементы.Вакансии.ВыделенныеСтроки;

	КоличествоВыбранных = МассивВыбранных.Количество();
	Если КоличествоВыбранных > 0 Тогда
		ОповеститьОВыборе(МассивВыбранных);
	КонецЕсли;
	
	Если КоличествоВыбранных > 1 Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранноеЗначение Из МассивВыбранных Цикл
		Если СписокПодобранных.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
			СписокПодобранных.Добавить(ВыбранноеЗначение);
		КонецЕсли; 
	КонецЦикла;
	
	ОбновитьОтображениеПодобранных();
	
КонецПроцедуры

&НаСервере
Процедура ВакансииПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура ВакансииПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВакансииПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Вакансии = Строки.ПолучитьКлючи();
	
	ДанныеВакансий = Справочники.Вакансии.ДанныеВакансий(Вакансии);
	
	ТаблицаИнформационныхСтрок = Справочники.Вакансии.ТаблицаИнформационныхСтрокЗанятостиПоВакансиям();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеВакансий, ТаблицаИнформационныхСтрок);
	
	Справочники.Вакансии.ЗаполнитьИнформационныеСтрокиЗанятостиПоВакансиям(ТаблицаИнформационныхСтрок);
	
	ЗапрашиватьКандидатов = НастройкаСписка(Настройки, НастройкиСписка().ВидимостьКандидатов, Истина);
	Если ЗапрашиватьКандидатов Тогда
		ТолькоКандидатыВРаботе = НастройкаСписка(Настройки, НастройкиСписка().ТолькоКандидатыВРаботе, Истина);
		Справочники.Вакансии.ЗаполнитьСтатистикуСостоянийКандидатов(ТаблицаИнформационныхСтрок, ТолькоКандидатыВРаботе);
		СброситьИзмененныеВакансии(Настройки, НастройкиСписка().ВакансииИзмененныхКандидатов, Вакансии);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаИнформационныхСтрок Цикл
		СтрокаСписка = Строки.Получить(СтрокаТаблицы.Вакансия);
		СтрокаСписка.Данные.ДополнительныеДанные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
		СтрокаСписка.Данные.ДополнительныеДанные.Вставить("ТолькоКандидатыВРаботе", ТолькоКандидатыВРаботе);
		СтрокаСписка.Данные.ДополнительныеДанные.Вставить("МоментОбновления", ТекущаяДатаСеанса());
	КонецЦикла;
	СброситьИзмененныеВакансии(Настройки, НастройкиСписка().ВакансииИзмененныхКандидатов, Вакансии);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКандидаты

&НаСервереБезКонтекста
Процедура КандидатыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ПодборПерсоналаФормы.ЗаполнитьОжидаемыйДоходВВалютеПоУмолчанию(Настройки, Строки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоЗаявке(Команда)
	НачатьСозданиеПоЗаявке();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаЗагрузитьССайта(Команда)
	
	ЗагрузитьВакансииССайта(СоответствиеКомандИСайтов[Команда.Имя], ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаВсеВакансии(Команда)
	
	ВидВсеВакансии = Истина;
	УстановитьВидСпискаВакансий(ЭтаФорма);
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоПодразделениям(Команда)
	
	ВидВсеВакансии = Ложь;
	УстановитьВидСпискаВакансий(ЭтаФорма);
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Вакансии);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Вакансии, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Вакансии);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПоказыватьОдобренныхОтклоненныхКандидатов(Команда)
	
	ТолькоКандидатыВРаботе = Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов.Пометка;
	УстановитьСнятьОтборОдобренныхОтклоненныхКандидатов(ЭтаФорма, ТолькоКандидатыВРаботе);
	НачатьЗаполнениеИнформационнойСтрокиКандидатов(ВыбраннаяВакансия);
	
	СохранитьНастройкуСписка(Вакансии.КомпоновщикНастроек.Настройки, "ТолькоКандидатыВРаботе", ТолькоКандидатыВРаботе);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоПрофилюДолжности(Команда)
	СоздатьВакансиюПоПрофилюДолжности(СоответствиеКомандПрофилям[Команда.Имя]);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоВыбранномуПрофилюДолжности(Команда)
	НачатьСозданиеВакансииПоПрофилюДолжности();
КонецПроцедуры

&НаКлиенте
Процедура СравнитьКандидатовПоХарактеристикам(Команда)
	ЭлектронноеИнтервьюКлиент.ОткрытьСравнениеПоХарактеристикам(ЭтотОбъект, ВыбраннаяВакансия,
		?(Элементы.Кандидаты.ВыделенныеСтроки.Количество() > 1, Элементы.Кандидаты.ВыделенныеСтроки, Неопределено));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьСписокВакансий()
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Вакансии.РежимВыбора = Истина;
		Если Параметры.Свойство("СписокПодобранных") Тогда
			СписокПодобранных.ЗагрузитьЗначения(Параметры.СписокПодобранных);
			ОбновитьОтображениеПодобранных();
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Свойство("ТолькоОткрытыеВакансии", Ложь);
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтаФорма, "Вакансии", , , , "Организация");
	СогласованиеВакансий.СписокСогласованияПриСозданииНаСервере(ЭтаФорма, "Вакансии", "Вакансии");
	
	УстановитьВидимостьОткликовКандидатов();
	
	СоздаватьВакансииТолькоПоЗаявке = ПолучитьФункциональнуюОпцию("ОткрытиеВакансииТребуетСогласования");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьПоЗаявке", "Видимость", СоздаватьВакансииТолькоПоЗаявке);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьПодменю", "Видимость", Не СоздаватьВакансииТолькоПоЗаявке);
	
	УстановитьУсловноеОформлениеСпискаВакансий();
	
	Если Не СоздаватьВакансииТолькоПоЗаявке Тогда
		СформироватьПодменюСозданияПоПрофилямДолжности();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПодменюСозданияПоПрофилямДолжности(ПрофилиДолжности = Неопределено)

	Если ПрофилиДолжности = Неопределено Тогда
		ПрофилиДолжности = ПоследниеИспользованныеПрофилиДолжности(5);
	КонецЕсли;
	
	УдалитьВсеКомандыСозданияПоПрофилямДолжности();
	ДобавитьКомандыСозданияПоПрофилямДолжности(ПрофилиДолжности);
	УстановитьВидимостьПодменюСоздатьПоПрофилямДолжности(ЭтотОбъект, ПрофилиДолжности);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПодменюСоздатьПоПрофилямДолжности(Форма, ПрофилиДолжности)
	Форма.Элементы.ПрофилиСозданияГруппаКоманд.Видимость = ПрофилиДолжности.Количество() > 0;
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеКомандыСозданияПоПрофилямДолжности()
	
	Если СоответствиеКомандПрофилям = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СоответствиеКомандПрофилям Цикл
		Элементы.Удалить(Элементы[КлючИЗначение.Ключ]);
		Команды.Удалить(Команды[КлючИЗначение.Ключ]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыСозданияПоПрофилямДолжности(ПрофилиДолжности)

	СоответствиеКоманд = Новый Соответствие;
	
	Для Каждого Профиль Из ПрофилиДолжности Цикл
		ИмяКоманды = ИмяКомандыПрофиля(Профиль);
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Заголовок = Строка(Профиль);
		НоваяКоманда.Действие = "СоздатьПоПрофилюДолжности";
		Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ПрофилиСозданияГруппаКоманд); 
		Кнопка.ИмяКоманды = НоваяКоманда.Имя;
		Кнопка.Заголовок = Строка(Профиль);
		СоответствиеКоманд.Вставить(ИмяКоманды, Профиль);
	КонецЦикла;

	СоответствиеКомандПрофилям = Новый ФиксированноеСоответствие(СоответствиеКоманд);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяКомандыПрофиля(Профиль)
	Возврат "СоздатьПоПрофилюДолжности_" + СтрЗаменить(Строка(Профиль.УникальныйИдентификатор()), "-", "_");
КонецФункции

&НаКлиенте
Процедура НачатьСозданиеВакансииПоПрофилюДолжности()
	
	ОткрытьФорму(
		"Справочник.ПрофилиДолжностей.ФормаВыбора", 
		Новый Структура("РежимВыбора", Истина), 
		ЭтотОбъект, , , , 
		Новый ОписаниеОповещения("ЗавершитьСозданиеВакансииПоПрофилюДолжности", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСозданиеВакансииПоПрофилюДолжности(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьВакансиюПоПрофилюДолжности(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВакансиюПоПрофилюДолжности(Профиль)

	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = Новый Структура("ПрофильДолжности", Профиль);
	
	ОткрытьФорму("Справочник.Вакансии.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВакансииССайта(Сайт, Форма) Экспорт
	
	Если Не ЗначениеЗаполнено(Сайт) Тогда
		Возврат;
	КонецЕсли;
	
	ВакансииССайта = РекрутинговыеСайтыВызовСервера.ВакансииССайта(Сайт);
	
	Если ВакансииССайта <> Неопределено
		И ВакансииССайта.Количество() > 0
		И ВакансииССайта[0] <> Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вакансии", ВакансииССайта);
		ПараметрыФормы.Вставить("Сайт", Сайт);
		
		ИмяФормыОбработки = "Обработка.ПубликацияВакансийНаРекрутинговыхСайтах.Форма.ЗагрузкаВакансий";
		
		РекрутинговыеСайтыКлиент.ОткрытьФормуОбработки(ИмяФормыОбработки, ПараметрыФормы, Форма);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Нет вакансий для загрузки'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоследниеИспользованныеПрофилиДолжности(МаксимумПрофилей)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 0
		|	ПрофильДолжности,
		|	ДатаОткрытия
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|ГДЕ
		|	Ответственный = &Пользователь
		|	И ПрофильДолжности <> ЗНАЧЕНИЕ(Справочник.ПрофилиДолжностей.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОткрытия УБЫВ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 0", "ПЕРВЫЕ " + МаксимумПрофилей);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПрофилиДолжности = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ПрофилиДолжности.Найти(Выборка.ПрофильДолжности) = Неопределено Тогда
			ПрофилиДолжности.Добавить(Выборка.ПрофильДолжности);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПрофилиДолжности;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеСпискаВакансий()
	
	ОформлениеСписка = Вакансии.УсловноеОформление;
	
	ЭлементОформления = ОформлениеСписка.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "Состояние", Перечисления.СостоянияВакансии.Открыта, ВидСравненияКомпоновкиДанных.НеРавно);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеОтклоненоЦветТекста);
	
	ЭлементОформления = ОформлениеСписка.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "Состояние", Перечисления.СостоянияВакансии.Открыта);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "ПометкаУдаления", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "ПланируемаяДатаЗакрытия", НачалоДня(ТекущаяДатаСеанса()), ВидСравненияКомпоновкиДанных.Меньше);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОткликовКандидатов()

	Если Параметры.РежимВыбора Тогда
		Элементы.ОповещенияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ОтборОткликов = Новый ОтборКомпоновкиДанных();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Вакансии.Отбор.Элементы, ОтборОткликов.Элементы);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборОткликов, "Ответственный", Пользователи.АвторизованныйПользователь());
	
	ОткликиКандидатов = ПодборПерсонала.ОткликиКандидатов(ОтборОткликов.Элементы);
	Если ОткликиКандидатов.Количество() = 0 Тогда
		Элементы.ОповещенияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ОповещенияГруппа.Видимость = Истина;
	ВакансииМассив = ОбщегоНазначения.ВыгрузитьКолонку(ОткликиКандидатов, "Вакансия", Истина);
	
	Если ВакансииМассив.Количество() = 1 Тогда
		ТекстПоВакансиям = НСтр("ru = 'по вакансии'");
	Иначе
		ТекстПоВакансиям = НСтр("ru = 'по вакансиям'");
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Есть не рассмотренные отклики (%1) %2'"), ОткликиКандидатов.Количество(), ТекстПоВакансиям);
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(ТекстСообщения);
	ЧастиСообщения.Добавить(" ");
	
	Индекс = 0;
	Пока Индекс < ВакансииМассив.Количество() Цикл
		Если Индекс > 3 Тогда
			// Слишком много - дальше не выводим.
			ЧастьЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'и по другим (всего %1)'"), ВакансииМассив.Количество());
			ЧастиСообщения.Добавить(" ");
			ЧастиСообщения.Добавить(ЧастьЗавершения);
			Прервать;
		КонецЕсли;
		Если Индекс > 0 Тогда
			ЧастиСообщения.Добавить(", ");
		КонецЕсли;
		Вакансия = ВакансииМассив[Индекс];
		ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(Строка(Вакансия), , , , ПолучитьНавигационнуюСсылку(Вакансия)));
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Элементы.ОповещениеОбОткликах.Заголовок = Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененыНастройкиДоступаКСайтам()
	
	РекрутинговыеСайтыФормы.ФормаСпискаВакансийПриИзмененииНастроекДоступаКСайтам(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПодобранных()
	
	Если ИдентификаторОформленияПодобранных	<> Неопределено Тогда
		ЭлементОформления = Вакансии.УсловноеОформление.ПолучитьОбъектПоИдентификатору(ИдентификаторОформленияПодобранных);
	Иначе
		ЭлементОформления = Вакансии.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
		ИдентификаторОформленияПодобранных = Вакансии.УсловноеОформление.ПолучитьИдентификаторПоОбъекту(ЭлементОформления);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "Ссылка", СписокПодобранных, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#Область ГруппировкаПоПодразделениям

&НаСервере
Процедура НастроитьВидСпискаВакансий()
	
	Если Параметры.РежимВыбора Тогда
		НастроитьВидСпискаВакансийВРежимеВыбора();
		Возврат;
	КонецЕсли;
	
	НастройкаВидВсеВакансии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ВакансииСписок", "ВидВсеВакансии");
	ВидВсеВакансии = НастройкаВидВсеВакансии;
	Если ВидВсеВакансии = Неопределено Тогда
		ВидВсеВакансии = Истина;
	КонецЕсли;
	
	УстановитьВидСпискаВакансий(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидСпискаВакансийВРежимеВыбора()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПодменю", "Видимость", Ложь);
	
	ВидВсеВакансии = Истина;
	УстановитьВидСпискаВакансий(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаПодразделений()
	
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СтруктураПредприятия.Отбор, "Источник", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидСпискаВакансий(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СтруктураПредприятия", "Видимость", Не Форма.ВидВсеВакансии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение", "Видимость", Форма.ВидВсеВакансии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидСпискаВсеВакансии", "Пометка", Форма.ВидВсеВакансии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидСпискаПоПодразделениям", "Пометка", Не Форма.ВидВсеВакансии);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	
	Если Форма.Элементы.СтруктураПредприятия.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ВидВсеВакансии Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Вакансии, "Подразделение");
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Вакансии.Отбор, "Подразделение", Форма.Элементы.СтруктураПредприятия.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.ВИерархии);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПодразделениюНаКлиенте()
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиВакансииНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСохраняемойНастройки()
	
	Настройки = СохраняемыеНастройки();
	Настройки.ВидВсеВакансии = ВидВсеВакансии;
	Настройки.ПоказыватьОдобренныхОтклоненныхКандидатов = Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов.Пометка;
	СохранитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки()
	
	Настройки = Новый Структура(
		"ВидВсеВакансии,
		|ПоказыватьОдобренныхОтклоненныхКандидатов");
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	
	Для Каждого КлючИЗначение Из Настройки Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ВакансииСписок", КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСнятьОтборОдобренныхОтклоненныхКандидатов(Форма, Использование)
	
	Элементы = Форма.Элементы;
	
	Кнопки = Новый Массив;
	Кнопки.Добавить(Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов);
	Кнопки.Добавить(Элементы.КандидатыКонтекстноеМенюПоказыватьОдобренныхОтклоненныхКандидатов);
	
	ПодборПерсоналаКлиентСервер.УстановитьСнятьОтборОдобренныхОтклоненныхКандидатов(Форма.Кандидаты, Использование, Кнопки);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриАктивизацииСтрокиВакансииНаКлиенте()
	
	Если Элементы.Вакансии.ТекущаяСтрока = Неопределено Тогда
		Вакансия = Неопределено;
	Иначе
		Вакансия = Элементы.Вакансии.ТекущаяСтрока;
	КонецЕсли;
	
	Если Вакансия = ВыбраннаяВакансия Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяВакансия = Вакансия;
	
	УстановитьОтборКандидатовПоВакансии(ЭтаФорма, ВыбраннаяВакансия);
	ЗаполнитьИнформационныеСтрокиВакансии(Вакансия);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборКандидатовПоВакансии(Форма, Вакансия)
	
	Если Форма.Элементы.КандидатыСписокГруппа.Видимость = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Кандидаты.Отбор, "Вакансия", Вакансия, ВидСравненияКомпоновкиДанных.Равно);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Кандидаты.Отбор, "Отображать", Ложь, , , Не ЗначениеЗаполнено(Вакансия));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформационныеСтрокиВакансии(Вакансия)
	
	ЗаполнитьИнформационнуюСтрокуЗанятости(Вакансия);
	ЗаполнитьИнформационнуюСтрокуКандидатов(Вакансия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформационнуюСтрокуЗанятости(Вакансия)

	ИнформацияЗанятости = Неопределено;
	ДанныеВыбраннойВакансии = Неопределено;
	
	Если ИнформацияЗанятостиТребуетОбновления(Вакансия) Тогда
		НачатьЗаполнениеИнформационнойСтрокиЗанятости(Вакансия);
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияЗанятости = ДополнительныеДанные.ИнформационнаяСтрокаЗанятости;
	ДанныеВыбраннойВакансии = ДополнительныеДанные;
	
КонецПроцедуры

&НаКлиенте
Функция ИнформацияЗанятостиТребуетОбновления(Вакансия)
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеПотерялиАктуальность(ДополнительныеДанные.МоментОбновления) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИзмененныеВакансии = НастройкаСписка(
		Вакансии.КомпоновщикНастроек.Настройки, НастройкиСписка().ИзмененныеВакансии, Новый Массив);
	
	Возврат ИзмененныеВакансии.Найти(Вакансия) <> Неопределено;

КонецФункции

&НаКлиенте
Функция ДанныеПотерялиАктуальность(МоментОбновления)
	
	Если МоментОбновления < ОбщегоНазначенияКлиент.ДатаСеанса() - ПериодичностьОбновления() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИнформационнуюСтрокуКандидатов(Вакансия)
	
	ИнформацияКандидатов = Неопределено;

	Если ИнформацияКандидатовТребуетОбновления(Вакансия) Тогда
		НачатьЗаполнениеИнформационнойСтрокиКандидатов(Вакансия);
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияКандидатов = ДополнительныеДанные.ИнформационнаяСтрокаКандидатов;

КонецПроцедуры

&НаКлиенте
Функция ИнформацияКандидатовТребуетОбновления(Вакансия)
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДополнительныеДанные.ТолькоКандидатыВРаботе <> ТолькоКандидатыВРаботе Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеПотерялиАктуальность(ДополнительныеДанные.МоментОбновления) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИзмененныеВакансии = НастройкаСписка(
		Вакансии.КомпоновщикНастроек.Настройки, НастройкиСписка().ВакансииИзмененныхКандидатов, Новый Массив);
	
	Возврат ИзмененныеВакансии.Найти(Вакансия) <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиПозицияМассовогоНабора(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "ПозицииВакансии" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Отбор");
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ДляОтбораПоМестуВСтруктуреПредприятия");
	ПараметрыФормы.Отбор = Новый Структура("Должность, МестоВСтруктуреПредприятия");
	ПараметрыФормы.Отбор.Должность = ДанныеВыбраннойВакансии.Должность;
	ПараметрыФормы.Отбор.МестоВСтруктуреПредприятия = ДанныеВыбраннойВакансии.Подразделение;
	
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиСотрудникиПозиции(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "СотрудникиПозиции") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Отбор");
	ПараметрыФормы.Отбор = Новый Структура("ДолжностьПоШтатномуРасписанию");
	ПараметрыФормы.Отбор.ДолжностьПоШтатномуРасписанию = ДополнительныеДанные.Позиция;
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеИнформационнойСтрокиКандидатов(Вакансия)
	
	ИнформацияКандидатов = Неопределено;
	Если Не ЗначениеЗаполнено(Вакансия) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИнформацияКандидатовЗаполняется.Видимость = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформационнойСтрокиКандидатов", ЭтотОбъект, Новый Структура("Вакансия", Вакансия));
	ПодборПерсоналаКлиент.НачатьЗаполнениеСчетчиковКандидатовПоВакансии(
		ВыбраннаяВакансия, ТолькоКандидатыВРаботе, ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнениеИнформационнойСтрокиКандидатов(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ИнформацияКандидатовЗаполняется.Видимость = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры.Вакансия <> ВыбраннаяВакансия Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияКандидатов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата).ИнформационнаяСтрокаКандидатов;
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные.ИнформационнаяСтрокаКандидатов = ИнформацияКандидатов;
	ДополнительныеДанные.ТолькоКандидатыВРаботе = ТолькоКандидатыВРаботе;
	ДополнительныеДанные.МоментОбновления = ОбщегоНазначенияКлиент.ДатаСеанса();

	СброситьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ВакансииИзмененныхКандидатов, 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбраннаяВакансия));
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеИнформационнойСтрокиЗанятости(Вакансия)
	
	ИнформацияЗанятости = Неопределено;
	Если Не ЗначениеЗаполнено(Вакансия) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИнформацияЗанятостиЗаполняется.Видимость = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформационнойСтрокиЗанятости", ЭтотОбъект, Новый Структура("Вакансия", Вакансия));
	ПодборПерсоналаКлиент.НачатьЗаполнениеИнформацииЗанятостиПоВакансии(
		ВыбраннаяВакансия, ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнениеИнформационнойСтрокиЗанятости(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ИнформацияЗанятостиЗаполняется.Видимость = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры.Вакансия <> ВыбраннаяВакансия Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияЗанятости = ПолучитьИзВременногоХранилища(Результат.АдресРезультата).ИнформационнаяСтрокаЗанятости;
	
	ДополнительныеДанные = ДополнительныеДанныеПоВакансии();
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеДанные.ИнформационнаяСтрокаЗанятости = ИнформацияЗанятости;
	ДанныеВыбраннойВакансии = ДополнительныеДанные;

	СброситьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ИзмененныеВакансии, 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбраннаяВакансия));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещенияЭтаповРаботыСКандидатами(ИмяСобытия, Параметр, Источник)
	
	ОбрабатываемыеСобытия = Новый Массив;
	ОбрабатываемыеСобытия.Добавить("ИзмененЭтапРаботыСКандидатом");
	ОбрабатываемыеСобытия.Добавить("РешениеПоКандидату");
	
	Если ОбрабатываемыеСобытия.Найти(ИмяСобытия) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметр.Свойство("Кандидаты") Или Не Параметр.Свойство("Вакансии") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ВакансииИзмененныхКандидатов, 
		Параметр.Вакансии);
	
	Если Параметр.Вакансии.Найти(ВыбраннаяВакансия) <> Неопределено Тогда
		НачатьЗаполнениеИнформационнойСтрокиКандидатов(ВыбраннаяВакансия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещенияИзмененияКандидата(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_Кандидаты" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметр.Свойство("Кандидаты") Или Не Параметр.Свойство("Вакансии") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ВакансииИзмененныхКандидатов, 
		Параметр.Вакансии);
	
	Если Параметр.Вакансии.Найти(ВыбраннаяВакансия) <> Неопределено Тогда
		НачатьЗаполнениеИнформационнойСтрокиКандидатов(ВыбраннаяВакансия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещенияИзмененияВакансии(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_Вакансии" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметр.Свойство("Вакансии") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ИзмененныеВакансии, 
		Параметр.Вакансии);
	
	Если Параметр.Вакансии.Найти(ВыбраннаяВакансия) <> Неопределено Тогда
		НачатьЗаполнениеИнформационнойСтрокиЗанятости(ВыбраннаяВакансия);
	КонецЕсли;
	
	ПоследниеПрофили = ПоследниеИспользованныеПрофилиДолжности(5);
	Если ОбщегоНазначенияКлиентСервер.РазностьМассивов(Параметр.ПрофилиДолжностей, ПоследниеПрофили).Количество() 
		< Параметр.ПрофилиДолжностей.Количество() Тогда
		СформироватьПодменюСозданияПоПрофилямДолжности(ПоследниеПрофили);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещенияИзмененияПозиции(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_ШтатноеРасписание" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ВакансииПозиции = ВакансииСПозицией(Источник);
	
	ДобавитьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ИзмененныеВакансии, 
		ВакансииПозиции);
	
	Если ВакансииПозиции.Найти(ВыбраннаяВакансия) <> Неопределено Тогда
		НачатьЗаполнениеИнформационнойСтрокиЗанятости(ВыбраннаяВакансия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВакансииСПозицией(Позиция)
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Позиция);
	
	Отбор = Новый ОтборКомпоновкиДанных();
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Отбор, 
		НСтр("ru = 'По позиции'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИЛИ, "Должность", ДанныеПозиции.Должность);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИЛИ, "Подразделение", ДанныеПозиции.МестоВСтруктуреПредприятия);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИЛИ, "Позиция", Позиция);
	
	Возврат Справочники.Вакансии.ВакансииПоОтбору(Отбор.Элементы);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОповещенияИзмененияЧисленности(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "ИзменениеДанныхМестаРаботы" Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Сотрудник");
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	ВакансииСотрудника = ВакансииСотрудника(Сотрудник);
	
	ДобавитьИзмененныеВакансии(
		Вакансии.КомпоновщикНастроек.Настройки, 
		НастройкиСписка().ИзмененныеВакансии, 
		ВакансииСотрудника);
	
	Если ВакансииСотрудника.Найти(ВыбраннаяВакансия) <> Неопределено Тогда
		НачатьЗаполнениеИнформационнойСтрокиЗанятости(ВыбраннаяВакансия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВакансииСотрудника(Сотрудник)
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "ДолжностьПоШтатномуРасписанию");
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
		
	Возврат ВакансииСПозицией(КадровыеДанные[0].ДолжностьПоШтатномуРасписанию);
	
КонецФункции

&НаСервере
Процедура НастроитьСписокКандидатов()
	
	Если Параметры.РежимВыбора Тогда
		Элементы.КандидатыСписокГруппа.Видимость = Ложь;
		СохранитьНастройкуСписка(Вакансии.КомпоновщикНастроек.Настройки, "ВидимостьКандидатов", Ложь);
		Возврат;
	КонецЕсли;
	
	Справочники.Кандидаты.УстановитьУсловноеОформлениеСпискаКандидатов(Кандидаты);
	
	ТолькоКандидатыВРаботе = Не ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ВакансииСписок", "ПоказыватьОдобренныхОтклоненныхКандидатов", Ложь);
	УстановитьСнятьОтборОдобренныхОтклоненныхКандидатов(ЭтаФорма, ТолькоКандидатыВРаботе);
	
	// Сохраняем видимость кандидатов в настройках для получения информационных строк.
	СохранитьНастройкуСписка(Вакансии.КомпоновщикНастроек.Настройки, "ВидимостьКандидатов", Элементы.КандидатыСписокГруппа.Видимость);
	СохранитьНастройкуСписка(Вакансии.КомпоновщикНастроек.Настройки, "ТолькоКандидатыВРаботе", ТолькоКандидатыВРаботе);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьНастройкуСписка(Настройки, ИмяНастройки, Значение)
	Настройки.ДополнительныеСвойства.Вставить(ИмяНастройки, Значение);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастройкаСписка(Настройки, ИмяНастройки, ЗначениеПоУмолчанию = Неопределено)
	
	Значение = Неопределено;
	Если Не Настройки.ДополнительныеСвойства.Свойство(ИмяНастройки, Значение) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиСписка()
	
	ОписаниеНастроек = Новый Структура;
	ОписаниеНастроек.Вставить("ТолькоКандидатыВРаботе", "ТолькоКандидатыВРаботе");
	ОписаниеНастроек.Вставить("ВакансииИзмененныхКандидатов", "ВакансииИзмененныхКандидатов");
	ОписаниеНастроек.Вставить("ИзмененныеВакансии", "ИзмененныеВакансии");
	ОписаниеНастроек.Вставить("ВидимостьКандидатов", "ВидимостьКандидатов");
	Возврат ОписаниеНастроек;
	
КонецФункции

&НаКлиенте
Процедура НачатьСозданиеПоЗаявке()
	
	ПараметрыВыбора = Новый Структура(
		"РежимВыбора, 
		|ТолькоДляСозданияВакансий");
	ПараметрыВыбора.РежимВыбора = Истина;
	ПараметрыВыбора.ТолькоДляСозданияВакансий = Истина;

	ОбработчикВыбора = Новый ОписаниеОповещения("ЗавершитьСозданиеПоЗаявке", ЭтотОбъект);
	
	ОткрытьФорму(
		"Документ.ЗаявкаНаПодборПерсонала.ФормаВыбора", 
		ПараметрыВыбора, 
		ЭтаФорма, 
		ЭтаФорма, , , 
		ОбработчикВыбора, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСозданиеПоЗаявке(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыНовой = Новый Структура("Основание");
	ПараметрыНовой.Основание = ВыбранноеЗначение;
	
	ОткрытьФорму("Справочник.Вакансии.ФормаОбъекта", ПараметрыНовой, ЭтаФорма, ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СброситьИзмененныеВакансии(Настройки, ИмяСпискаВакансий, СбрасываемыеВакансии)
	
	ИзмененныеВакансии = НастройкаСписка(Настройки, ИмяСпискаВакансий, Новый Массив);
	Если ИзмененныеВакансии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкуСписка(Настройки, ИмяСпискаВакансий, 
		ОбщегоНазначенияКлиентСервер.РазностьМассивов(ИзмененныеВакансии, СбрасываемыеВакансии));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьИзмененныеВакансии(Настройки, ИмяСпискаВакансий, ДобавляемыеВакансии)
	
	Если ДобавляемыеВакансии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененныеВакансии = НастройкаСписка(Настройки, ИмяСпискаВакансий, Новый Массив);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИзмененныеВакансии, ДобавляемыеВакансии, Истина);
	СохранитьНастройкуСписка(Настройки, ИмяСпискаВакансий, ИзмененныеВакансии);
	
КонецПроцедуры

&НаКлиенте
Функция ДополнительныеДанныеПоВакансии()

	ТекущиеДанные = Элементы.Вакансии.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДополнительныеДанные = ТекущиеДанные.ДополнительныеДанные;
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДополнительныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнформационныеСтрокиВакансии()
	
	Если ЗначениеЗаполнено(ВыбраннаяВакансия) Тогда
		ЗаполнитьИнформационныеСтрокиВакансии(ВыбраннаяВакансия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПериодичностьОбновления()
	Возврат 600;
КонецФункции

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Интервал) Экспорт
	ПодключитьОбработчикОжидания("ПроверитьЗагруженныхИзИнтернетаКандидатов", Интервал);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов() Экспорт
	ОтключитьОбработчикОжидания("ПроверитьЗагруженныхИзИнтернетаКандидатов");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗагруженныхИзИнтернетаКандидатов()
	ЗагрузкаКандидатовИзИнтернетаКлиент.ПроверитьЗагруженныхИзИнтернетаКандидатов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
